/*
Copyright (c) 2021 Theodor Totev

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

/*
Pishtov is a C header that mimics Yashu's JS Pishtov. It tries not only to be
faster by being written in C but to also be more powerful.

The point of the JS Pishtov is to remove the boilerplate from game programming
and thus make it easy to teach children programming. The JS Pishtov is very
successful in this domain. Many young programmers were and are taught

        // VK_MBUTTON 0x04 Middle mouse button (three-button mouse)
        // VK_XBUTTON1 0x05 X1 mouse button
        // VK_XBUTTON2 0x06 X2 mouse button
        // --- 0x07 Undefined
    case XK_BackSpace:      return 0x08; // VK_BACK 0x08 BACKSPACE key
    case XK_Tab:            return 0x09; // VK_TAB 0x09 TAB key
                            // --- 0x0A-0B Reserved
    case XK_Clear:          return 0x0c; // VK_CLEAR 0x0C CLEAR key
    case XK_KP_Enter:
    case XK_Return:         return 0x0d; // VK_RETURN 0x0D ENTER key
                            // --- 0x0E-0F Undefined
    case XK_Shift_L:        return 0x10; // VK_SHIFT 0x10 SHIFT key
    case XK_Control_L:      return 0x11; // VK_CONTROL 0x11 CTRL key
    case XK_Alt_L:
    case XK_Alt_R:          return 0x12; // VK_MENU 0x12 ALT key
    case XK_Pause:          return 0x13; // VK_PAUSE 0x13 PAUSE key
    case XK_Caps_Lock:      return 0x14; // VK_CAPITAL 0x14 CAPS LOCK key
                            // TODO I don't even know what these buttons are supposed to do
                            // VK_KANA 0x15 IME Kana mode
                            // VK_HANGUEL 0x15 IME Hanguel mode (maintained for compatibility; use VK_HANGUL)
                            // VK_HANGUL 0x15 IME Hangul mode
                            // VK_IME_ON 0x16 IME On
                            // VK_JUNJA 0x17 IME Junja mode
                            // VK_FINAL 0x18 IME final mode
                            // VK_HANJA 0x19 IME Hanja mode
                            // VK_KANJI 0x19 IME Kanji mode
                            // VK_IME_OFF 0x1A IME Off
    case XK_Escape:         return 0x1b; // VK_ESCAPE 0x1B ESC key
                            // VK_CONVERT 0x1C IME convert VK_NONCONVERT 0x1D IME nonconvert
                            // VK_ACCEPT 0x1E IME accept
                            // VK_MODECHANGE 0x1F IME mode change request
    case XK_space:          return 0x20; // VK_SPACE 0x20 SPACEBAR
    case XK_Page_Up:        return 0x21; // VK_PRIOR 0x21 PAGE UP key
    case XK_Page_Down:      return 0x22; // VK_NEXT 0x22 PAGE DOWN key
    case XK_End:            return 0x23; // VK_END 0x23 END key
    case XK_Begin:
    case XK_Home:           return 0x24; // VK_HOME 0x24 HOME key
    case XK_Left:           return 0x25; // VK_LEFT 0x25 LEFT ARROW key
    case XK_Up:             return 0x26; // VK_UP 0x26 UP ARROW key
    case XK_Right:          return 0x27; // VK_RIGHT 0x27 RIGHT ARROW key
    case XK_Down:           return 0x28; // VK_DOWN 0x28 DOWN ARROW key
    case XK_Select:         return 0x29; // VK_SELECT 0x29 SELECT key
                            // VK_PRINT 0x2A PRINT key
    case XK_Execute:        return 0x2b; // VK_EXECUTE 0x2B EXECUTE key
    case XK_Print:          return 0x2c; // VK_SNAPSHOT 0x2C PRINT SCREEN key
    case XK_Insert:         return 0x2d; // VK_INSERT 0x2D INS key
    case XK_Delete:         return 0x2e; // VK_DELETE 0x2E DEL key
    case XK_Help:           return 0x2f; // VK_HELP 0x2F HELP key
    case XK_0:              return 0x30; // 0x30 0 key
    case XK_1:              return 0x31; // 0x31 1 key
    case XK_2:              return 0x32; // 0x32 2 key
    case XK_3:              return 0x33; // 0x33 3 key
    case XK_4:              return 0x34; // 0x34 4 key
    case XK_5:              return 0x35; // 0x35 5 key
    case XK_6:              return 0x36; // 0x36 6 key
    case XK_7:              return 0x37; // 0x37 7 key
    case XK_8:              return 0x38; // 0x38 8 key
    case XK_9:              return 0x39; // 0x39 9 key
                            // --- 0x3A-40 Undefined
    case XK_a:
    case XK_A:              return 0x41; // 0x41 A key
    case XK_b:
    case XK_B:              return 0x42; // 0x42 B key
    case XK_c:
    case XK_C:              return 0x43; // 0x43 C key
    case XK_d:
    case XK_D:              return 0x44; // 0x44 D key
    case XK_e:
    case XK_E:              return 0x45; // 0x45 E key
    case XK_f:
    case XK_F:              return 0x46; // 0x46 F key
    case XK_g:
    case XK_G:              return 0x47; // 0x47 G key
    case XK_h:
    case XK_H:              return 0x48; // 0x48 H key
    case XK_i:
    case XK_I:              return 0x49; // 0x49 I key
    case XK_j:
    case XK_J:              return 0x4a; // 0x4A J key
    case XK_k:
    case XK_K:              return 0x4b; // 0x4B K key
    case XK_l:
    case XK_L:              return 0x4c; // 0x4C L key
    case XK_m:
    case XK_M:              return 0x4d; // 0x4D M key
    case XK_n:
    case XK_N:              return 0x4e; // 0x4E N key
    case XK_o:
    case XK_O:              return 0x4f; // 0x4F O key
    case XK_p:
    case XK_P:              return 0x50; // 0x50 P key
    case XK_q:
    case XK_Q:              return 0x51; // 0x51 Q key
    case XK_r:
    case XK_R:              return 0x52; // 0x52 R key
    case XK_s:
    case XK_S:              return 0x53; // 0x53 S key
    case XK_t:
    case XK_T:              return 0x54; // 0x54 T key
    case XK_u:
    case XK_U:              return 0x55; // 0x55 U key
    case XK_v:
    case XK_V:              return 0x56; // 0x56 V key
    case XK_w:
    case XK_W:              return 0x57; // 0x57 W key
    case XK_x:
    case XK_X:              return 0x58; // 0x58 X key
    case XK_y:
    case XK_Y:              return 0x59; // 0x59 Y key
    case XK_z:
    case XK_Z:              return 0x5a; // 0x5A Z key
    case XK_Super_L:        return 0x5b; // VK_LWIN 0x5B Left Windows key (Natural keyboard)
    case XK_Super_R:        return 0x5c; // VK_RWIN 0x5C Right Windows key (Natural keyboard)
                            // VK_APPS 0x5D Applications key (Natural keyboard)
                            // --- 0x5E Reserved
                            // VK_SLEEP 0x5F Computer Sleep key
    case XK_KP_0:
    case XK_KP_Insert:      return 0x60; // VK_NUMPAD0 0x60 Numeric keypad 0 key
    case XK_KP_1:
    case XK_KP_End:         return 0x61; // VK_NUMPAD1 0x61 Numeric keypad 1 key
    case XK_KP_2:
    case XK_KP_Down:        return 0x62; // VK_NUMPAD2 0x62 Numeric keypad 2 key
    case XK_KP_3:
    case XK_KP_Page_Down:   return 0x63; // VK_NUMPAD3 0x63 Numeric keypad 3 key
    case XK_KP_4:
    case XK_KP_Left:        return 0x64; // VK_NUMPAD4 0x64 Numeric keypad 4 key
    case XK_KP_5:
